In [24]:
import pandas as pd
import numpy as np

In [25]:
date=pd.read_csv("E:\Workspace\Datasets\orders.csv")
time=pd.read_csv("E:\Workspace\Datasets\messages.csv")

<>:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
<>:2: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
<>:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
<>:2: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
C:\Users\Vertex\AppData\Local\Temp\ipykernel_19664\1849575888.py:1: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
  date=pd.read_csv("E:\Workspace\Datasets\orders.csv")
C:\Users\Vertex\AppData\Local\Temp\ipykernel_19664\1849575888.py:2: SyntaxWarning: "\W" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\W"? A raw string is also an option.
  time=pd.read_csv("E:\Workspace\Datasets\messages.csv")

In [26]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [27]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [28]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [29]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

Pandas bydefault import date and time as object. so we need to change it

## Working with date

In [30]:
#Converting to date and time
date['date']=pd.to_datetime(date["date"])

In [31]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### Extract Year

In [32]:
date["date_year"]=date["date"].dt.year

In [33]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

### Extract Month

In [34]:
date["date_month"]=date["date"].dt.month_name()
date.head()

        date  product_id  city_id  orders  date_year date_month
0 2019-12-10        5628       25       3       2019   December
1 2018-08-15        3646       14     157       2018     August
2 2018-10-23        1859       25       1       2018    October
3 2019-08-17        7292       25       1       2019     August
4 2019-01-06        4344       25       3       2019    January

### Extract days

In [35]:
date["date_days"]=date["date"].dt.day
date.head()

        date  product_id  city_id  orders  date_year date_month  date_days
0 2019-12-10        5628       25       3       2019   December         10
1 2018-08-15        3646       14     157       2018     August         15
2 2018-10-23        1859       25       1       2018    October         23
3 2019-08-17        7292       25       1       2019     August         17
4 2019-01-06        4344       25       3       2019    January          6

### Week extraction

In [36]:
date["dow"]=date["date"].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_days,dow
0,2019-12-10,5628,25,3,2019,December,10,1
1,2018-08-15,3646,14,157,2018,August,15,2
2,2018-10-23,1859,25,1,2018,October,23,1
3,2019-08-17,7292,25,1,2019,August,17,5
4,2019-01-06,4344,25,3,2019,January,6,6

### Day of week name

In [37]:
date["day_of_week"]=date["date"].dt.day_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_days,dow,day_of_week
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday

### Is weekend

In [38]:
date["date_is_weekend"]=np.where (date["day_of_week"].isin(["Sunday","Sunday"]),1,0)
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_days,dow,day_of_week,date_is_weekend
0,2019-12-10,5628,25,3,2019,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,August,17,5,Saturday,0
4,2019-01-06,4344,25,3,2019,January,6,6,Sunday,1

In [39]:
date=date.drop(columns=["product_id","city_id","orders"],inplace=True)

AttributeError: 'NoneType' object has no attribute 'head'